cmsis-svd/cmsis-svd/data/Holtek/ht32f125x.xml
        <!--CKCU_AHBCCR-->
        <register>
          <name>CKCU_AHBCCR</name>
          <displayName>CKCU_AHBCCR</displayName>
          <description>CKCU_AHBCCR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>FMCEN</name>
              <description>FMCEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRAMEN</name>
              <description>SRAMEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_APBCFGR-->
        <register>
          <name>CKCU_APBCFGR</name>
          <displayName>CKCU_APBCFGR</displayName>
          <description>CKCU_APBCFGR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADCDIV</name>
              <description>ADCDIV</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:19]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_APBCCR0-->
        <register>
          <name>CKCU_APBCCR0</name>
          <displayName>CKCU_APBCCR0</displayName>
          <description>CKCU_APBCCR0</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>I2CEN</name>
              <description>I2CEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SPIEN</name>
              <description>SPIEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>UREN</name>
              <description>UREN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>AFIOEN</name>
              <description>AFIOEN</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTIEN</name>
              <description>EXTIEN</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PAEN</name>
              <description>PAEN</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBEN</name>
              <description>PBEN</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_APBCCR1-->
        <register>
          <name>CKCU_APBCCR1</name>
          <displayName>CKCU_APBCCR1</displayName>
          <description>CKCU_APBCCR1</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WDTEN</name>
              <description>WDTEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTCEN</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>GPTM0EN</name>
              <description>GPTM0EN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>GPTM1EN</name>
              <description>GPTM1EN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>OPA0EN</name>
              <description>OPA0EN</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>OPA1EN</name>
              <description>OPA1EN</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADCEN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:25]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_CKST-->
        <register>
          <name>CKCU_CKST</name>
          <displayName>CKCU_CKST</displayName>
          <description>CKCU_CKST</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PLLST</name>
              <description>PLLST</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>HSEST</name>
              <description>HSEST</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>HSIST</name>
              <description>HSIST</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_LPCR-->
        <register>
          <name>CKCU_LPCR</name>
          <displayName>CKCU_LPCR</displayName>
          <description>CKCU_LPCR</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BKISO</name>
              <description>BKISO</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CKCU_MCUDBGCR-->
        <register>
          <name>CKCU_MCUDBGCR</name>
          <displayName>CKCU_MCUDBGCR</displayName>
          <description>CKCU_MCUDBGCR</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBSLP</name>
              <description>DBSLP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBDSLP1</name>
              <description>DBDSLP1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBPD</name>
              <description>DBPD</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBWDT</name>
              <description>DBWDT</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBGPTM0</name>
              <description>DBGPTM0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBGPTM1</name>
              <description>DBGPTM1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBUSART</name>
              <description>DBUSART</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBSPI</name>
              <description>DBSPI</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBDSLP2</name>
              <description>DBDSLP2</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
