cmsis-svd/cmsis-svd/data/Holtek/ht32f125x.xml
        <!--AFIO_GPBCFGR-->
        <register>
          <name>AFIO_GPBCFGR</name>
          <displayName>AFIO_GPBCFGR</displayName>
          <description>AFIO_GPBCFGR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PBCFG0</name>
              <description>PBCFG0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG1</name>
              <description>PBCFG1</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG2</name>
              <description>PBCFG2</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG3</name>
              <description>PBCFG3</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG4</name>
              <description>PBCFG4</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG5</name>
              <description>PBCFG5</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG6</name>
              <description>PBCFG6</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG7</name>
              <description>PBCFG7</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG8</name>
              <description>PBCFG8</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG9</name>
              <description>PBCFG9</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG10</name>
              <description>PBCFG10</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG11</name>
              <description>PBCFG11</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG12</name>
              <description>PBCFG12</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG13</name>
              <description>PBCFG13</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG14</name>
              <description>PBCFG14</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG15</name>
              <description>PBCFG15</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--EXTI-->
    <peripheral>
      <name>EXTI</name>
      <version>1.0</version>
      <description>EXTI</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40024000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>EXTI0</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>EXTI1</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>EXTI2</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>EXTI3</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>EXTI4</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>EXTI5</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>EXTI6</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>EXTI7</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>EXTI8</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>EXTI9</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>EXTI10</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>EXTI11</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>EXTI12</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>EXTI13</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>EXTI14</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>EXTI15</name>
        <value>39</value>
      </interrupt>
      <registers>
        <!--EXTI_CFGR0-->
        <register>
          <name>EXTI_CFGR0</name>
          <displayName>EXTI_CFGR0</displayName>
          <description>EXTI_CFGR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR1-->
        <register>
          <name>EXTI_CFGR1</name>
          <displayName>EXTI_CFGR1</displayName>
          <description>EXTI_CFGR1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
