cmsis-svd/cmsis-svd/data/Holtek/ht32f125x.xml
        <!--EXTI_CFGR2-->
        <register>
          <name>EXTI_CFGR2</name>
          <displayName>EXTI_CFGR2</displayName>
          <description>EXTI_CFGR2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR3-->
        <register>
          <name>EXTI_CFGR3</name>
          <displayName>EXTI_CFGR3</displayName>
          <description>EXTI_CFGR3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR4-->
        <register>
          <name>EXTI_CFGR4</name>
          <displayName>EXTI_CFGR4</displayName>
          <description>EXTI_CFGR4</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR5-->
        <register>
          <name>EXTI_CFGR5</name>
          <displayName>EXTI_CFGR5</displayName>
          <description>EXTI_CFGR5</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR6-->
        <register>
          <name>EXTI_CFGR6</name>
          <displayName>EXTI_CFGR6</displayName>
          <description>EXTI_CFGR6</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR7-->
        <register>
          <name>EXTI_CFGR7</name>
          <displayName>EXTI_CFGR7</displayName>
          <description>EXTI_CFGR7</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
