cmsis-svd/cmsis-svd/data/Holtek/ht32f125x.xml
        <!--EXTI_CFGR8-->
        <register>
          <name>EXTI_CFGR8</name>
          <displayName>EXTI_CFGR8</displayName>
          <description>EXTI_CFGR8</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR9-->
        <register>
          <name>EXTI_CFGR9</name>
          <displayName>EXTI_CFGR9</displayName>
          <description>EXTI_CFGR9</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR10-->
        <register>
          <name>EXTI_CFGR10</name>
          <displayName>EXTI_CFGR10</displayName>
          <description>EXTI_CFGR10</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR11-->
        <register>
          <name>EXTI_CFGR11</name>
          <displayName>EXTI_CFGR11</displayName>
          <description>EXTI_CFGR11</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR12-->
        <register>
          <name>EXTI_CFGR12</name>
          <displayName>EXTI_CFGR12</displayName>
          <description>EXTI_CFGR12</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR13-->
        <register>
          <name>EXTI_CFGR13</name>
          <displayName>EXTI_CFGR13</displayName>
          <description>EXTI_CFGR13</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
