cmsis-svd/cmsis-svd/data/Holtek/ht32f125x.xml
        <!--GPTM1_CH1ICFR-->
        <register>
          <name>GPTM1_CH1ICFR</name>
          <displayName>GPTM1_CH1ICFR</displayName>
          <description>GPTM1_CH1ICFR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI1F</name>
              <description>TI1F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1CCS</name>
              <description>CH1CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1PSC</name>
              <description>CH1PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH2ICFR-->
        <register>
          <name>GPTM1_CH2ICFR</name>
          <displayName>GPTM1_CH2ICFR</displayName>
          <description>GPTM1_CH2ICFR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI2F</name>
              <description>TI2F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2CCS</name>
              <description>CH2CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2PSC</name>
              <description>CH2PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH3ICFR-->
        <register>
          <name>GPTM1_CH3ICFR</name>
          <displayName>GPTM1_CH3ICFR</displayName>
          <description>GPTM1_CH3ICFR</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI3F</name>
              <description>TI3F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3CCS</name>
              <description>CH3CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3PSC</name>
              <description>CH3PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH0OCFR-->
        <register>
          <name>GPTM1_CH0OCFR</name>
          <displayName>GPTM1_CH0OCFR</displayName>
          <description>GPTM1_CH0OCFR</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0OM</name>
              <description>CH0OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>REF0CE</name>
              <description>REF0CE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0PRE</name>
              <description>CH0PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0IMAE</name>
              <description>CH0IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH1OCFR-->
        <register>
          <name>GPTM1_CH1OCFR</name>
          <displayName>GPTM1_CH1OCFR</displayName>
          <description>GPTM1_CH1OCFR</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1OM</name>
              <description>CH1OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>REF1CE</name>
              <description>REF1CE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1PRE</name>
              <description>CH1PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1IMAE</name>
              <description>CH1IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH2OCFR-->
        <register>
          <name>GPTM1_CH2OCFR</name>
          <displayName>GPTM1_CH2OCFR</displayName>
          <description>GPTM1_CH2OCFR</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2OM</name>
              <description>CH2OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>REF2CE</name>
              <description>REF2CE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2PRE</name>
              <description>CH2PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2IMAE</name>
              <description>CH2IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH3OCFR-->
        <register>
          <name>GPTM1_CH3OCFR</name>
          <displayName>GPTM1_CH3OCFR</displayName>
          <description>GPTM1_CH3OCFR</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH3OM</name>
              <description>CH3OM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>REF3CE</name>
              <description>REF3CE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3PRE</name>
              <description>CH3PRE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3IMAE</name>
              <description>CH3IMAE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CHCTR-->
        <register>
          <name>GPTM1_CHCTR</name>
          <displayName>GPTM1_CHCTR</displayName>
          <description>GPTM1_CHCTR</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0E</name>
              <description>CH0E</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1E</name>
              <description>CH1E</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2E</name>
              <description>CH2E</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3E</name>
              <description>CH3E</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CHPOLR-->
        <register>
          <name>GPTM1_CHPOLR</name>
          <displayName>GPTM1_CHPOLR</displayName>
          <description>GPTM1_CHPOLR</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0P</name>
              <description>CH0P</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1P</name>
              <description>CH1P</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2P</name>
              <description>CH2P</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3P</name>
              <description>CH3P</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_ICTR-->
        <register>
          <name>GPTM1_ICTR</name>
          <displayName>GPTM1_ICTR</displayName>
          <description>GPTM1_ICTR</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0CCIE</name>
              <description>CH0CCIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1CCIE</name>
              <description>CH1CCIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2CCIE</name>
              <description>CH2CCIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3CCIE</name>
              <description>CH3CCIE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>UEVIE</name>
              <description>UEVIE</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TEVIE</name>
              <description>TEVIE</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_EVGR-->
        <register>
          <name>GPTM1_EVGR</name>
          <displayName>GPTM1_EVGR</displayName>
          <description>GPTM1_EVGR</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0CCG</name>
              <description>CH0CCG</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1CCG</name>
              <description>CH1CCG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH2CCG</name>
              <description>CH2CCG</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH3CCG</name>
              <description>CH3CCG</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>UEVG</name>
              <description>UEVG</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TEVG</name>
              <description>TEVG</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
